# თეორია:
# 1)კომენტარების სახით ახსენით input
# ინფუთი არის ყველაფერი რაც მოწყობილობაში შედის.

# 2)კომენტარების სახით ახსენით რა არის output
# აყთფუთი არის ყველაფერი რაც მოწყობილობიდან გამოდის.

# 3)კომენატრების სახით ახსენით რა არის ფუნქცია
# მრავარჯერადად გამოყენებადი კოდის ბლოკი რომელიც სპეციალურად რაიმე დავალების შესასრულებლად გამოიენება.

# 4)კომენტარების სახით ჩამოწერეთ ყველა ნასწავლი data conversation function(მაგ: int())


# 5)კომენტარების სახით ჩამოწერეთ input & output ის მაგალითები
# ინფუთის მაგალითებია: მიკროფონში შემავალი ხმა, კომპიუტერში შეტანილი ინფორმაცია, ტელეფონში ცაწერილი მუსიკა და სხა...
# აუთფუთის მაგალითებია: დინამიკიდან გამოსული ხმა, ასევე ყურსასმენიდან გამოსული ხმა და სხვა...