# 3) შექმენით სია სადაც შეიყვანთ თქვენი მეგობრის სახელებს, შემდეგ თუ სახელი იწყება 'a'-ზე, ეს სახელი ჩაამატეთ ცალკე სიაში, 
# საბოლოოდ კი დაპრინტეთ მიღებული სია

name = ['lika', 'elene', 'mariami', 'anastasia']
name2 = []
for i in name:
    if i[0] == 'a':
        name2.append(i)
print(name2)



# # 4) შექმენით სია სადაც შეიყვანთ თქვენი მეგობრის სახელებს, შემდეგ თუ სახელის ბოლო ასო არის 'a', ეს სახელი ჩაამატეთ ცალკე სიაში,
# # საბოლოოდ კი დაპრინტეთ მიღებული სია

name = ['lika', 'elene', 'mariami' 'anastasia']
name2 = []
for i in name:
    if i[-1] == 'a':
         name2.append(i)
print(name2)



