# კონიუქცია - ლოგიკური "და", პროგრამირებაში ეწოდება "AND", აღნიშვნა &&
# დიზუნქცია - ლოგიკური "ან", პროგრამირებაში ეწოდება "OR", აღნიშვნა ||

# 1) ახსენი შენი სიტყვებით დეტალურად and-სა და or-ს შორის განსხვავებები
# and ოპერატორი გვავალდებულებს ყველა პირობის დაკმაყოფილებას, ხოლო or ოპერეტორი არ გვავალდებულებს ყველა პირობის შესრულებას.
# ანუ მათ შორის განსხვავება ისაა რომ ერთი ოპერატორი გვავალდებულებს ყველა პირობის შესრულებას ხოლო მეორე ოპერატორი არა.
                                                                   
# 2) მოიყვანე 5 ყოველდღიური მაგალითი and-ზე და or-ზე (მაგ: თუ შაბათია და კარგი ამინდია მე ვითამაშებ ფეხბურთს:
# ამ მაგალითში გამოყენებულია ორი True-ს მდგომარეობა და ამიტომაც ამას ისევ True-ზე გავყავართ.)
# თუ შაბათია და დავალება მექნება ვიმეცადინებ - გვაქვს True და True ამიტომ პასუხი =True
# თუ სკოლაა და სახლში მოვდივარ ვისვენებ - გვაქვს True და True ამიტომ პასუხი =True
# თუ გართობა ან თამაში მომინდა ეზოში ჩავდივარ - გვაქვს True და True ამიტომ პასუხი =True
# თუ ხვალ იქნება კონცერტი და არ იწვიმებს - თუ კონცერტი არ იქნება გამოდის False და True =False
# თუ ხვალ იქნება კონცერტი ან იქნება სკოლა გავალ გარეთ -არ იქნება კონცერტი და არ იქნება სკოლა გამოდის False ან False =False
                                                           
# 3) ვთქვათ A = „გიორგი სპორტზეა“, B = „ანა მუსიკაზეა“.
# დაწერეთ, რა იქნება შედეგი:

# A and B

# A or B

# თუ A = True, B = True -  and=True or=True
# თუ A = True, B = False -  and=False or=True
# თუ A = False, B = True -  and=False or=True
# # თუ A = False, B = False -  and=False or=False