# 1)შექმენით სია 5 ელემენტით, nums = [1, 2, 3, 4, 5]  და შემდეგ append ის საშუალებით  ჩაამატეთ კიდე 5 ელემენტი, 6, 7, 8, 9, 10


nums = [1, 2, 3, 4, 5]
nums.append(6)
nums.append(7)
nums.append(8)
nums.append(9)
nums.append(10)
print(nums)



# 2)ზემოთ მოცემული სიიდან, ამოშალეთ მე 6 ინდექსზე მდგომი ელემენტი და ასევე ამოშალეთ რიცხვი 9 იანი
  
#     0  1  2  3  4  5  6  7  8  9
nums=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
nums.pop(6)
nums.remove(9)
print(nums)




# 3)ზემოთ მოცემული სიიდან, მე 4 ინდექსზე ჩაამატეთ ახალი ელემენტი, სტრინგი "new string"
#     0  1  2  3  4  5  6  7  8  9
nums=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
nums.insert(4, 'new string')
print(nums)