
# 1)შექმენით იმდენი ცვლადი, რამდენი წლისაც ხართ და თითეულში შეინახეთ რიცხვი რომელიც ყოველჯერზე დიდება

number=1
number=2
number=3
number=4
number=5
number=6
number=7
number=8
number=9
number=10
number=11

# 2)კომენტარების სახით ახსენით ყველაფერი რაც წერია აქ:
# snake_case=არის პატარა ასოებით დაწერილი ცვლადის სახელი რომელიც გამოიყიფა ქვედა ტირეთი და შედგება რამდენიმე სიტყვისაგან.
# camelCase=არის დიდი ასოებით დაწერილი მაგრამ პატარა ასოებით დაწყებული ერთად დაწერილი ცვლადის სახელი.
# case sensitive language=პითონი არის case sensitive language, რაც იმას ნიშნავს რომ ძალიან დიდი მნაშვნელობა აქვს ცვლადის სახელს დიდი ასოთი დავწერთ თუ პატარათი.
# html=არის საიტის ჩონჩხი, რომელსაც დიზააინისა და ბრძანებების დახვეწა სჭირდება.
# string integer float=string არის ასოებით ჩაწერილი ცვლადი, integer არის მთელი ხოლო float არამთელი რიცხვი.

# html

# html=არის საიტის ჩონჩხი, რომელსაც სჭირდება დიზაინი და ბრძანებების დახვეწა.
# css=არის  html ით შექმნილი საიტის  შედარებით დახვეწილი ვარიანტი,მაგრამ მაინც სჭირდება უფრო დახვეწა და გათანამედროვება.
# js=არის დახვეწილი, ჩამოყალიბებული, ბრანებებ მიცემული საიტი რომელიც  html ით და css ით შექმნილ საიტს ათანამედროვებს.

# html იშიფრება ასე hyper text markup language.