# თეორია:
# 1)კომენტარების სახით ახსენით iteration
# iterarion იგივეა რაც განმეორება.

# 2)კომენტარების სახით ახსენით  loop
# loop არის კოდის განმეორებით შესრულება.

# 3)კომენატრების სახით ახსენით infinity loop
# infiniti loop არის დაუსრულებელი ლუპი.

# 4)კომენტარების სახით ახსენით for loop
# for loop არის კოდის განმეორების მარტივი და მოკლე გზა.

# 5)კომენტარების სახით ჩამოწერეთ განმეორების მაგალითები
# მაგალითად ჩვენ ყოველ დღე მივდივართ სახლიდან სკოლაში.
# ჩვენ ყოველდღე ვჭამთ საჭმელს და სხვა...