
# კომენტარების სახით ახსენით რა არის snake_case და camelCase, რა განსხვავებაა მათ შორის:
# snake_case არის რამდენიმე სიტყვისაგან შემდგარი _ით გამოყიფილი ცვლადის სახელი რომელიც იწერება პატარა ასოებით.
# camelcase არის ერთად დაწერილი დიდი ასოებით შემდგარი ცვლადის სახელი.
# მათ შორის მთავარი განსხვავება ისაა რომ, ერთი დიდი ასოებით იწერება მეორე პატარათი.

# კომენტარების სახით ახსენით რას ნიშნავს რომ პითონი არის case sentensive language:
# ეს იმას ნიშნავს რომ ძალიან დიდი მნიშვნელობა აქვს ცვლადის სახელს დიდი ასოებით ჩაწერ თუ პატარა ასოებით.

# კომენატრების სახით ახსენით რა არის debugging:
# debugging არის კოდში შეცდომების ანუ ერორების გასწორება.

# კომენტარების სახით ჩამოწერეთ ცვლადის სახელის შექმნის წესები:
# არ შეიძლება ცვლადის სახელი დაიწყოს რიცხვებით.
# არ შეიძლება ცვლადის სახელში იყოს სიმბოლოები როგორიცაა:/ * ' ; ,  და სხვა...

# კომენტარების სახით ახსენით რა არის კომენტარი და რაში გამოიყენებ:
# კომენტარი არის #ით დაწყებული ნებისმიერი წარწერა თუ სიმბოლო.
# ის გამოიყენება იმაში რომ პროგრამამ ესა თუ ის გამოსახულება ვერ აღიქვას და მხოლოდ ადამიანისთვის იყოს ხილული.