# 4)კომენტარების  სახით ახსენით if elif else


# if არის "თუ" და იწერება მხოლოდ ერთხელ და დააწყისში.
# elif არის "სხვა შემთზვევაში" და იწერება შუაშ და რამდენჯერაც გვინდა.
# else არის  "სხვა შმთხვევაში" და იწერება ერთხელ ბოლოში.


# 5)კომენტარების სახით ახსენით მონაცემთა ტიპები

# მონაცემთა ტიპი არის string, intejer და float. ანუ როგორ შგვიძლია ჩავწეროთ მონაცემები.
# string არის ყველეფერი რაც წერია ბრჭყალებში  მაგ: "აბგდევზ", "ბაბი", "883"
# intejer არის ყველა მთელი რიცხვი მინუსებიც კი მაგ:438, 48, 89, -55, -59...
# float არის ყველა არამთელი რიცხვი მაგ: 3,5, 392,90, 0,4282...