# თეორია:
# 1)კომენტარების სახით ახსენით რა არის boolean
# boolean არის 2 დაყოფილი true და folse დაყოფილი მონაცემთა ტიპი რომელიც გვიჩვენებს სწორია თუ არა მაგალითი თუ სხვა რამ.

# 2)კომენტარების სახით ჩამოწერეთ data type(მონაცემთა ტიპი) 
#  int, float და string.

# 3)კომენატრების სახით ახსენით რა არის binary
# binary არის ერთადერთი გასაგები ენა რომელიც ჩვენს დაწერილ ინფორმაციას გადააქცევს 0ად და 1ად დაწერილ რიცხვებად,
# ანუ კომპიუტერისთვის გასაგებ ენად.

# 4)კომენტარების სახით ჩამოწერეთ ყველა ნასწავლი data conversation ფუნქცია (მაგ: int())
# int(), str(), folat().

# 5)კომენტარების სახით ახსენით, რაზეა დამოკიდებული პროგრამირების ენის სიჩქარე, რისგან შედგება binary,
#  ჩამოწერეთ True & False ის რიცხვობითი მნიშვნოლობები და იპოვეთ მსგავსება, binary სა და boolean ს შორის,
#  მოიყვანეთ boolean ის რამოდენიმე მაგალითი

# true=1, folse=0.
# პროგრამის ენის სიჩქარე იმაზეა დამოკიდებული თუ რამდენად სწრაფად გადააქცევს კომპიუტერი ინფორმაციას ბაინარად.
# binary შედგება 1ით და 0ით.
# boolean ის მაგალითია - number=5+5==10   number=true
# ბულეანის true და folse აღნიშნავს 1ს და 0ს, ისევე როგორც ბაინარის.
