# 1)შექმენით ფუნქცია, რომელიც მიიღებს არგუმენტად სახელს(სტრინგს) და დაპრინტავს  "გამარჯობა " + სახელი

def name(name2):
    return 'hello ' + name2

print(name('babi'))


# 2)შექმენი ფუნქცია, რომელიც  მიიღებს არგუმენტად რიცხვს  და გაამრავლებს მაგას ორზე

def number(number2):
    return number2 * 2

print(number(10))


# 3)შექმენი ფუნქცია, რომელიც მიიიღებს არგუმენტად სტრინგს და დაპრინტავს ბოლო ასოს

def name(name2):
    return name2[-1]

print(name('babi'))


# 4)ახსენით რას აკეთებს return
# return აბრუნებს ერთ მნიშვნელობას რის შემდეგაც ფინქცია ჩერდება.
# return გამოიყენება print-ის მაგივრად რადგან ის უფრო კარგი საშუალებაა.
# return გამოიყენება მაშინ როცა ვქმნით ფუნქციას.


