# 1)შექმენით სია, 10 ცალი ნებისმიერი ელემენტით, და შემდეგ მომხარებელს შემოატანინეთ რიცხვი,
#  საბოლოოდ დაპრინტეთ ამ სიაში მაგ ინდექსზე მდგომი ელემენტი ( რაც მომხარებელმა შემოიტანა )

# #      0         1       2    3    4     5       6    7    8     9
list=['babi', 'giorgi', 15, 15.5, True, False, 'goa', 30, 14.8, 100]

name=int(input('enter your list:'))
print(list[name])


# 2)შექმენით სია, 10 ცალი ნებისმიერი ელემენტით, და შემდეგ მომხარებელს შემოატანინეთ რიცხვი ორჯერ, საბოლოოდ 
#  ამ სიაში პირველი შემოტანილი რიცხვიდან მეორე შემოტანილ რიცხვამდე გამოიტანეთ ელემენტები slicing ის გამოყენებით

#      0         1       2    3    4     5       6    7    8     9
list=['babi', 'giorgi', 15, 15.5, True, False, 'goa', 30, 14.8, 100]

name=int(input("enter your list: "))
number=int(input("enter your list: "))

print(list[name:number])

