
# 2️⃣ დავალება
# შექმენით ცარიელი სია.
# for loop-ის საშუალებით სიაში ჩაამატეთ რიცხვების კვადრატები 1-დან 10-მდე
# (მაგ: 1², 2², 3² …).

list = []
for i in range(1, 10):
    list.append(str(i) + '²')   
print(list)


# 3️⃣ დავალება
# შექმენით ცარიელი სია.
# for loop-ის გამოყენებით სიაში ჩაამატეთ კენტი რიცხვები 1-დან 15-მდე.

# 4️⃣ დავალება
# შექმენით ცარიელი სია.
# for loop-ის საშუალებით სიაში ჩაამატეთ რიცხვები 10-დან 1-მდე უკუღმა.

# 5️⃣ დავალება
# შექმენით ცარიელი სია.
# for loop-ის გამოყენებით სიაში ჩაამატეთ რიცხვები 1-დან 10-მდე, თითოეული გამრავლებული 3-ზე.