# 1) შექმენით ცვლადი name სადაც შეინახავთ თქვენს სახელს, შემდეგ კი დაპრინტეთ თქვენი სახელი ისე, რომ ყველა ასო იყოს დიდი

name = 'babi'
print(name.upper())


# 2) შექმენით ცვლადი lastname სადაც შეინახავთ თქვენს გვარს, შემდეგ კი დაპრინტეთ თქვენი სახელი ისე, რომ ყველა ასო იყოს პატარა
lastname = 'RTVELIASHVILI'
print(lastname.lower())


# 3) შექმენით ცვლადი fullname სადაც შეინახავთ თქვენს სახელს და გვარს, შემდეგ კი დაპრინტეთ ისე რომ სახელიც და გვარიც დიდი ასოთი იწყებოდეს
fullname = 'babi rtveliashvili'
print(fullname.title())


# 4) შექმენით ცვლადი fruit სადაც შეინახავთ თქვენს საყვარელ ხილს, შემდეგ კი იპოვეთ ამ ხილის სახელში შედის თუ არა ასო 'ა'
fruit = 'საზამთრო'
print(fruit.find('ა'))